{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v2.0.1", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "conv1_5/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv1_bn_5/gamma", "shape": [32], "dtype": "float32"}, {"name": "conv1_bn_5/beta", "shape": [32], "dtype": "float32"}, {"name": "conv1_bn_5/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "conv1_bn_5/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1_5/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "conv_dw_1_bn_5/gamma", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1_bn_5/beta", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1_bn_5/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1_bn_5/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv_pw_1_5/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "conv_pw_1_bn_5/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv_pw_1_bn_5/beta", "shape": [64], "dtype": "float32"}, {"name": "conv_pw_1_bn_5/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv_pw_1_bn_5/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_2_5/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "conv_dw_2_bn_5/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_2_bn_5/beta", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_2_bn_5/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_2_bn_5/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv_pw_2_5/kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "conv_pw_2_bn_5/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_2_bn_5/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_2_bn_5/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_2_bn_5/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_3_5/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "conv_dw_3_bn_5/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_3_bn_5/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_3_bn_5/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_3_bn_5/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_3_5/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "conv_pw_3_bn_5/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_3_bn_5/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_3_bn_5/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_3_bn_5/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4_5/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "conv_dw_4_bn_5/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4_bn_5/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4_bn_5/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4_bn_5/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_4_5/kernel", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "conv_pw_4_bn_5/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_4_bn_5/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_4_bn_5/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_4_bn_5/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_5_5/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "conv_dw_5_bn_5/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_5_bn_5/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_5_bn_5/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_5_bn_5/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_5_5/kernel", "shape": [1, 1, 256, 256], "dtype": "float32"}, {"name": "conv_pw_5_bn_5/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_5_bn_5/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_5_bn_5/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_5_bn_5/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6_5/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "conv_dw_6_bn_5/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6_bn_5/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6_bn_5/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6_bn_5/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_6_5/kernel", "shape": [1, 1, 256, 512], "dtype": "float32"}, {"name": "conv_pw_6_bn_5/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_6_bn_5/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_6_bn_5/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_6_bn_5/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_7_5/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_7_bn_5/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_7_bn_5/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_7_bn_5/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_7_bn_5/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_7_5/kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv_pw_7_bn_5/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_7_bn_5/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_7_bn_5/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_7_bn_5/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_8_5/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_8_bn_5/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_8_bn_5/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_8_bn_5/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_8_bn_5/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_8_5/kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv_pw_8_bn_5/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_8_bn_5/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_8_bn_5/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_8_bn_5/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_9_5/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_9_bn_5/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_9_bn_5/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_9_bn_5/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_9_bn_5/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_9_5/kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv_pw_9_bn_5/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_9_bn_5/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_9_bn_5/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_9_bn_5/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_10_5/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_10_bn_5/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_10_bn_5/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_10_bn_5/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_10_bn_5/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_10_5/kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv_pw_10_bn_5/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_10_bn_5/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_10_bn_5/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_10_bn_5/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11_5/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_11_bn_5/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11_bn_5/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11_bn_5/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11_bn_5/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_11_5/kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv_pw_11_bn_5/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_11_bn_5/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_11_bn_5/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_11_bn_5/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12_5/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_12_bn_5/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12_bn_5/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12_bn_5/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12_bn_5/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_12_5/kernel", "shape": [1, 1, 512, 1024], "dtype": "float32"}, {"name": "conv_pw_12_bn_5/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_12_bn_5/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_12_bn_5/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_12_bn_5/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_13_5/depthwise_kernel", "shape": [3, 3, 1024, 1], "dtype": "float32"}, {"name": "conv_dw_13_bn_5/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_13_bn_5/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_13_bn_5/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_13_bn_5/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_13_5/kernel", "shape": [1, 1, 1024, 1024], "dtype": "float32"}, {"name": "conv_pw_13_bn_5/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_13_bn_5/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_13_bn_5/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_13_bn_5/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "dense_6/kernel", "shape": [1024, 4], "dtype": "float32"}, {"name": "dense_6/bias", "shape": [4], "dtype": "float32"}]}]}